rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Stand by me"], ["rating", "PG-13"], ["created_at", "2015-12-04 21:27:02.376412"], ["updated_at", "2015-12-04 21:27:02.376412"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def find_by_director
    unless params[:director] == 'nil'
      @movies = Movie.where(director: CGI.unescape(params[:director]))